# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [33]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [5]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

* make access to the `Age` column of the `DataFrame` you created in the previous task;
* add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`;
* filter the `DataFrame` to show only the rows with the `Age` greater than 18.

### Taks 3.1

In [6]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

In [8]:
df["Salary"] = [50000, 60000, 45000]
df

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Taks 3.3

In [10]:
df[df["Age"] > 18]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

* add new calculated field `Birth year`;
* add new calculated field `Avarage age`.

### Task 4.1

In [15]:
from datetime import datetime # to avoid warnings from pandas

df["Birth year"] = datetime.now().year - df["Age"]
df

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2007
1  Emily   28  Los Angeles   60000        1995
2   Ryan   22      Chicago   45000        2001

### Task 4.2

In [24]:
df["Average age"] = df["Age"].mean()
# or
df["Average age"] = np.mean(df["Age"])
df

    Name  Age         City  Salary  Birth year  Average age
0   John   16     New York   50000        2007         22.0
1  Emily   28  Los Angeles   60000        1995         22.0
2   Ryan   22      Chicago   45000        2001         22.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [38]:
data1 = {"Name": ["John", "Emily", "Ryan"], "Age": [25, 28, 22]}
data2 = {
    "Name": ["Emily", "Ryan", "Mike"],
    "City": ["Los Angeles", "Chicago", "Houston"],
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [36]:
merged_df = pd.merge(df1, df2, on="Name")
merged_df

    Name  Age         City
0  Emily   28  Los Angeles
1   Ryan   22      Chicago

In [37]:
concatenated_df = pd.concat([df1, df2])
concatenated_df

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
0  Emily   NaN  Los Angeles
1   Ryan   NaN      Chicago
2   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [32]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [3]:
s1 + s2

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [4]:
s1 - s2

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [5]:
s1 * s2

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [6]:
s1 / s2

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [7]:
s1 ** s2

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [8]:
s1 // s2

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [9]:
s1 % s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
s1[s1 % 2 == 0]

1    2
3    4
dtype: int64

In [20]:
s2[s2 % 2 != 0]

1    7
3    9
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [10]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [13]:
s.str.upper()

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [14]:
s.str.len()

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [28]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: user 5.07 s, sys: 107 ms, total: 5.17 s
Wall time: 5.28 s

[36.4, 39.8, 51.2, 49.6, 52.8, 62.2, 63.0, 46.0, 39.6, 42.4]

### Solution using Pandas and Numpy

The Pandas and NumPy solution utilizes the power of vectorized operations and built-in functions to calculate the moving average more efficiently. The dataset is generated using NumPy's random number generator and stored in a Pandas Series. The rolling mean function from Pandas is then applied to the series with a window size of 5 to compute the moving average.

In [31]:
def unknown_signature():
    data = pd.Series(np.random.randint(1, 100, size=10000000))

    return data.rolling(window=5).mean().dropna().tolist()[:10]

%time unknown_signature()

CPU times: user 333 ms, sys: 117 ms, total: 449 ms
Wall time: 523 ms

[42.0, 35.8, 41.0, 49.8, 35.2, 40.4, 58.0, 50.6, 34.6, 49.8]